'''
 CalcTree5. В текстовом файле с именем filename дано арифметическое выражение в
 префиксной форме. Операндами в выражении являются целые числа из промежутка от 0
 до 9. Используемые операции: сложение (+), вычитание (-), умножение (*) и деление
 нацело(/). Постройте дерево, соответствующее данному выражению. Знаки операций
 кодируйте числами: сложение(-1), вычитание(-2), умножение(-3), деление(-4).
 Преобразуйте дерево так, чтобы в нем не было операций сложения и вычитания. Иными
 словами, замените поддеревья, в которых есть сложение или вычитание значением
 данного поддерева. Выведите указатель на корень полученного дерева.
 
 Языковая модель: https://giga.chat
 '''

